aws/amazon-freertos/lib/bluetooth_low_energy/portable/nordic/nrf52840-dk/aws_ble_hal_gap.c
    if( xErrCode == NRF_SUCCESS )
    {
        /* TODO: Think, do we even need that? */
        xErrCode = sd_ble_uuid_vs_add( ( ble_uuid128_t * ) pxAppUuid->uu.uu128, &ucBaseUUIDindex );
    }

    BT_NRF_PRINT_ERROR( sd_ble_uuid_vs_add, xErrCode );

    if( xErrCode == NRF_SUCCESS )
    {
        xAppUuid.ucType = pxAppUuid->ucType;
        memcpy( &xAppUuid.uu.uu128, &( pxAppUuid->uu.uu128 ), bt128BIT_UUID_LEN );

        if( xBTBleAdapterCallbacks.pxRegisterBleAdapterCb )
        {
            xBTBleAdapterCallbacks.pxRegisterBleAdapterCb( eBTStatusSuccess, 0, pxAppUuid );
        }
    }

    return BTNRFError( xErrCode );
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTUnregisterBleApp( uint8_t ucAdapterIf )
{
    ret_code_t xErrCode = NRF_SUCCESS;

    if( ucBaseUUIDindex == 0 )
    {
        /* No app is registered */
        xErrCode == NRF_ERROR_INVALID_PARAM;
    }
    xErrCode = ble_conn_params_stop();
    prvBTFreeAdvData( &prvAdvData );
    prvBTFreeAdvData( &prvScanResponseData );

    /* We cannot remove the VS UUID because the SoftDevice can only remove the latest vendor-specific UUID */
    if( xErrCode == NRF_SUCCESS )
    {
        /* xErrCode = sd_ble_uuid_vs_remove( &ucBaseUUIDindex ); */
        ucBaseUUIDindex = 0;
    }

    BT_NRF_PRINT_ERROR( sd_ble_uuid_vs_remove, xErrCode );

    return BTNRFError( xErrCode );
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTGetBleAdapterProperty( BTBlePropertyType_t xType )
{
    BTStatus_t xStatus = eBTStatusUnsupported;

    return xStatus;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTSetBleAdapterProperty( const BTBleProperty_t * pxProperty )
{
    BTStatus_t xStatus = eBTStatusUnsupported;

    return xStatus;
}


/*-----------------------------------------------------------*/

BTStatus_t prvBTGetallBleRemoteDeviceProperties( BTBdaddr_t * pxRremoteAddr )
{
    BTStatus_t xStatus = eBTStatusUnsupported;

    return xStatus;
}


/*-----------------------------------------------------------*/

BTStatus_t prvBTGetBleRemoteDeviceProperty( BTBdaddr_t * pxRemoteAddr,
                                            BTBleProperty_t xType )
{
    BTStatus_t xStatus = eBTStatusUnsupported;

    return xStatus;
}


/*-----------------------------------------------------------*/

BTStatus_t prvBTSetBleRemoteDeviceProperty( BTBdaddr_t * pxRemoteAddr,
                                            const BTBleProperty_t * pxProperty )
{
    BTStatus_t xStatus = eBTStatusUnsupported;

    return xStatus;
}


/*-----------------------------------------------------------*/

BTStatus_t prvBTScan( bool bStart )
{
    BTStatus_t xStatus = eBTStatusUnsupported;

    return xStatus;
}


/*-----------------------------------------------------------*/

BTStatus_t prvBTConnect( uint8_t ucAdapterIf,
                         const BTBdaddr_t * pxBdAddr,
                         bool bIsDirect,
                         BTTransport_t ulTransport )
{
    BTStatus_t xStatus = eBTStatusUnsupported;

    return xStatus;
}


/*-----------------------------------------------------------*/


BTStatus_t prvBTDisconnect( uint8_t ucAdapterIf,
                            const BTBdaddr_t * pxBdAddr,
                            uint16_t usConnId )
{
    ret_code_t xErrCode = sd_ble_gap_disconnect( usConnHandle,
                                                 BLE_HCI_LOCAL_HOST_TERMINATED_CONNECTION );

    xLatestDesiredConnectionParams.pxBdAddr = NULL;
    BT_NRF_PRINT_ERROR( sd_ble_gap_disconnect, xErrCode );
    return BTNRFError( xErrCode );
}

/*-----------------------------------------------------------*/

ret_code_t prvStartAdv()
{
    ret_code_t xStatus;

    if( prvAdvRestart )
    {
        xStatus = prvResumeAdvertisement(BLE_GAP_ADV_TYPE_CONNECTABLE_SCANNABLE_UNDIRECTED); 
    }
    else
    {
        prvAdvRestart = true;
        xStatus = ble_advertising_start( &xAdvertisingHandle, BLE_ADV_MODE_FAST );
    }
    
    if( NRF_SUCCESS ==  xStatus )
    {
      bIsAdvertising = true;
    }
     return xStatus;
}

ret_code_t prvStopAdv()
{
    return sd_ble_gap_adv_stop( xAdvertisingHandle.adv_handle );
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTStartAdv( uint8_t ucAdapterIf )
{
    BTStatus_t xStatus;
    ret_code_t xErrCode = prvStartAdv();

    BT_NRF_PRINT_ERROR( ble_advertising_start, xErrCode );

    xStatus = BTNRFError( xErrCode );

    if( xBTBleAdapterCallbacks.pxAdvStartCb )
    {
        xBTBleAdapterCallbacks.pxAdvStartCb( xStatus, usGattConnHandle );
    }

    return xStatus;
}


/*-----------------------------------------------------------*/

BTStatus_t prvBTStopAdv( uint8_t ucAdapterIf )
{
    BTStatus_t xStatus;
    ret_code_t xErrCode;

    bIsAdvertising = false;
    xErrCode = prvStopAdv();
    /* User can inadvertentely try to stop advertising when it is already stopped,
    * for example when connection is established and SD stopped advertising itself.
    * In this case we are going to get NRF_ERROR_INVALID_STATE, but this is fine */
    if (xErrCode == NRF_ERROR_INVALID_STATE) {
        xErrCode = NRF_SUCCESS;
        NRF_LOG_WARNING("Attempt to stop an already stopped advertising");
    }
    BT_NRF_PRINT_ERROR( sd_ble_gap_adv_stop, xErrCode );
    xStatus = BTNRFError( xErrCode );
    return xStatus;
}


/*-----------------------------------------------------------*/

BTStatus_t prvBTReadRemoteRssi( uint8_t ucAdapterIf,
                                const BTBdaddr_t * pxBdAddr )
{
    BTStatus_t xStatus = eBTStatusUnsupported;

    return xStatus;
}


/*-----------------------------------------------------------*/

BTStatus_t prvBTScanFilterParamSetup( BTGattFiltParamSetup_t xFiltParam )
{
    BTStatus_t xStatus = eBTStatusUnsupported;

    return xStatus;
}


/*-----------------------------------------------------------*/

BTStatus_t prvBTScanFilterAddRemove( uint8_t ucAdapterIf,
                                     uint32_t ulAction,
                                     uint32_t ulFiltType,
                                     uint32_t ulFiltIndex,
                                     uint32_t ulCompanyId,
                                     uint32_t ulCompanyIdMask,
                                     const BTUuid_t * pxUuid,
                                     const BTUuid_t * pxUuidMask,
                                     const BTBdaddr_t * pxBdAddr,
                                     char cAddrType,
                                     size_t xDataLen,
                                     char * pcData,
                                     size_t xMaskLen,
                                     char * pcMask )
{
    BTStatus_t xStatus = eBTStatusUnsupported;

    return xStatus;
}


/*-----------------------------------------------------------*/

BTStatus_t prvBTScanFilterEnable( uint8_t ucAdapterIf,
                                  bool bEnable )
{
    BTStatus_t xStatus = eBTStatusUnsupported;

    return xStatus;
}


/*-----------------------------------------------------------*/

BTTransport_t prvBTGetDeviceType( const BTBdaddr_t * pxBdAddr )
{
    BTStatus_t xStatus = eBTStatusUnsupported;

    return xStatus;
}

/*-----------------------------------------------------------*/

