aws/amazon-freertos/lib/bluetooth_low_energy/portable/nordic/nrf52840-dk/aws_ble_hal_gap.c
ret_code_t prvAFRUUIDtoNordic( BTUuid_t * pxAFRUuid,
                               ble_uuid_t * pxNordicUUID )
{
    ret_code_t xStatus = NRF_SUCCESS;
    ble_uuid128_t xNordicUUID128;

    switch( pxAFRUuid->ucType )
    {
        case eBTuuidType16:
            pxNordicUUID->type = BLE_UUID_TYPE_BLE;
            pxNordicUUID->uuid = pxAFRUuid->uu.uu16;
            break;

        case eBTuuidType128:

            for( int i = 0; i < 16; ++i )
            {
                xNordicUUID128.uuid128[ i ] = pxAFRUuid->uu.uu128[ i ];
            }

            xStatus = sd_ble_uuid_vs_add( &xNordicUUID128, &pxNordicUUID->type );
            pxNordicUUID->uuid = *( ( uint16_t * ) &( xNordicUUID128.uuid128[ 12 ] ) );
            break;

        default:
            xStatus = NRF_ERROR_NOT_SUPPORTED;
    }

    return xStatus;
}

void prvBTFreeAdvData( ble_advdata_t * xAdvData )
{
    vPortFree( xAdvData->p_tx_power_level );
    vPortFree( xAdvData->p_slave_conn_int );

    vPortFree( xAdvData->uuids_complete.p_uuids );
    vPortFree( xAdvData->uuids_more_available.p_uuids );
    vPortFree( xAdvData->uuids_solicited.p_uuids );

    if( xAdvData->p_manuf_specific_data )
    {
        vPortFree( xAdvData->p_manuf_specific_data->data.p_data );
    }

    vPortFree( xAdvData->p_manuf_specific_data );

    if( xAdvData->p_service_data_array )
    {
        vPortFree( xAdvData->p_service_data_array->data.p_data );
    }

    vPortFree( xAdvData->p_service_data_array );
    vPortFree( xAdvData->p_tk_value );
    vPortFree( xAdvData->p_sec_mgr_oob_flags );
    vPortFree( xAdvData->p_lesc_data );
    memset( xAdvData, 0, sizeof( ble_gap_adv_data_t ) );
}

ret_code_t prvBTAdvDataConvert( ble_advdata_t * xAdvData,
                                BTGattAdvertismentParams_t * pxParams,
                                uint16_t usManufacturerLen,
                                char * pcManufacturerData,
                                uint16_t usServiceDataLen,
                                char * pcServiceData,
                                BTUuid_t * pxServiceUuid,
                                size_t xNbServices )
{
    prvBTFreeAdvData( xAdvData );
    ret_code_t xErrCode = NRF_SUCCESS;

    ble_advdata_uuid_list_t xCompleteUUIDS;

    memset( &xCompleteUUIDS, 0, sizeof( xCompleteUUIDS ) );

    if( pxParams->ulAppearance )
    {
        xAdvData->include_appearance = pxParams->ulAppearance;
    }

    xAdvData->flags = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;

    if( pxParams->bIncludeName )
    {
        xAdvData->name_type = BLE_ADVDATA_FULL_NAME;
    }
    else
    {
        xAdvData->name_type = BLE_ADVDATA_NO_NAME;
    }

    if( pxParams->bIncludeTxPower )
    {
        xAdvData->p_tx_power_level = pvPortMalloc( sizeof( int8_t ) );

        if( xAdvData->p_tx_power_level == NULL )
        {
            xErrCode = NRF_ERROR_NO_MEM;
        }
        else
        {
            *xAdvData->p_tx_power_level = 0; /* TODO: Find out where to get real tx_power */
        }
    }
    else
    {
        xAdvData->p_tx_power_level = NULL;
    }

    if( xErrCode == NRF_SUCCESS )
    {
        xAdvData->include_ble_device_addr = false; /* TODO: Find out where to get whether set address or not */

        /* TODO: Set address type */
        /* TODO: Find out what to do with the channel map */
        if( xNbServices != 0 )
        {
            xCompleteUUIDS.uuid_cnt = xNbServices;
            xCompleteUUIDS.p_uuids = pvPortMalloc( sizeof( ble_uuid_t ) * xNbServices );

            if( xCompleteUUIDS.p_uuids == NULL )
            {
                xErrCode = NRF_ERROR_NO_MEM;
            }

            for( uint8_t ucCService = 0; ucCService < xNbServices; ucCService++ )
            {
                if( ( pxServiceUuid[ ucCService ].ucType == eBTuuidType16 ) ||
                    ( pxServiceUuid[ ucCService ].ucType == eBTuuidType128 ) )
                {
                    if( xErrCode != NRF_SUCCESS )
                    {
                        break;
                    }

                    /* We've already checeked the correctness of UUID type before, so we can ignore the returned value */
                    prvAFRUUIDtoNordic( &pxServiceUuid[ ucCService ], &xCompleteUUIDS.p_uuids[ ucCService ] );
                }
                else
                {
                    xErrCode = NRF_ERROR_NOT_SUPPORTED;
                }
            }
        }
    }

    if( xErrCode == NRF_SUCCESS )
    {
        /* The first two UUID go to the initial advertisement packet */
        xAdvData->uuids_complete = xCompleteUUIDS;
        xAdvData->p_slave_conn_int->max_conn_interval = pxParams->ulMaxInterval;
        xAdvData->p_slave_conn_int->min_conn_interval = pxParams->ulMinInterval;

        if( ( pcManufacturerData != NULL ) && ( usManufacturerLen != 0 ) )
        {
            xAdvData->p_manuf_specific_data = pvPortMalloc( sizeof( ble_advdata_manuf_data_t ) );

            if( xAdvData->p_manuf_specific_data == NULL )
            {
                xErrCode = NRF_ERROR_NO_MEM;
            }
            else
            {
                xAdvData->p_manuf_specific_data->data.p_data = pvPortMalloc( usManufacturerLen );

                if( xAdvData->p_manuf_specific_data->data.p_data )
                {
                    xErrCode = NRF_ERROR_NO_MEM;
                }
                else
                {
                    memcpy( xAdvData->p_manuf_specific_data->data.p_data, pcManufacturerData, usManufacturerLen );
                    xAdvData->p_manuf_specific_data->data.size = usManufacturerLen;
                }
            }
        }
    }

    if( xErrCode == NRF_SUCCESS )
    {
        if( ( pcServiceData != NULL ) && ( usServiceDataLen != 0 ) )
        {
            xAdvData->p_service_data_array = pvPortMalloc( sizeof( ble_advdata_manuf_data_t ) );

            if( xAdvData->p_service_data_array == NULL )
            {
                xErrCode = NRF_ERROR_NO_MEM;
            }
            else
            {
                xAdvData->p_service_data_array->data.p_data = pvPortMalloc( usServiceDataLen );

                if( xAdvData->p_service_data_array->data.p_data )
                {
                    xErrCode = NRF_ERROR_NO_MEM;
                }
                else
                {
                    memcpy( xAdvData->p_service_data_array->data.p_data, pcServiceData, usServiceDataLen );
                    xAdvData->p_service_data_array->data.size = usServiceDataLen;
                }
            }
        }
    }

    return xErrCode;
}


BTStatus_t prvBTSetAdvData( uint8_t ucAdapterIf,
                            BTGattAdvertismentParams_t * pxParams,
                            uint16_t usManufacturerLen,
                            char * pcManufacturerData,
                            uint16_t usServiceDataLen,
                            char * pcServiceData,
                            BTUuid_t * pxServiceUuid,
                            size_t xNbServices )
{
    ret_code_t xErrCode = NRF_SUCCESS;
    BTStatus_t xStatus = eBTStatusSuccess;

