aws/amazon-freertos/lib/bluetooth_low_energy/portable/nordic/nrf52840-dk/aws_ble_hal_gap.c
BTStatus_t prvBTBatchscanDisBatchScan( uint8_t ucAdapterIf )
{
    BTStatus_t xStatus = eBTStatusUnsupported;

    return xStatus;
}


/*-----------------------------------------------------------*/

BTStatus_t prvBTBatchscanReadReports( uint8_t ucAdapterIf,
                                      uint32_t ulScanMode )
{
    BTStatus_t xStatus = eBTStatusUnsupported;

    return xStatus;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTSetPreferredPhy( uint16_t usConnId,
                                 uint8_t ucTxPhy,
                                 uint8_t ucRxPhy,
                                 uint16_t usPhyOptions )
{
    BTStatus_t xStatus = eBTStatusUnsupported;

    return xStatus;
}


/*-----------------------------------------------------------*/

BTStatus_t prvBTReadPhy( uint16_t usConnId,
                         BTReadClientPhyCallback_t xCb )
{
    BTStatus_t xStatus = eBTStatusUnsupported;

    return xStatus;
}

/*-----------------------------------------------------------*/

const void * prvBTGetGattClientInterface()
{
    return NULL;
}

/*-----------------------------------------------------------*/

const void * prvGetLeAdapter()
{
    return &xBTLeAdapter;
}

ret_code_t prvConnectionParamsInit( void )
{
    ret_code_t xErrCode;
    ble_conn_params_init_t cp_init;
    ble_gap_conn_params_t gap_params_init;

    memset( &cp_init, 0, sizeof( cp_init ) );

    gap_params_init.conn_sup_timeout = aws_ble_gap_configCONN_SUP_TIMEOUT;
    gap_params_init.max_conn_interval = aws_ble_gap_configMAX_CONN_INTERVAL;
    gap_params_init.min_conn_interval = aws_ble_gap_configMIN_CONN_INTERVAL;
    gap_params_init.slave_latency = aws_ble_gap_configSLAVE_LATENCY;

    cp_init.p_conn_params = &gap_params_init;
    cp_init.first_conn_params_update_delay = aws_ble_gap_configFIRST_CONN_PARAMS_UPDATE_DELAY;
    cp_init.next_conn_params_update_delay = aws_ble_gap_configNEXT_CONN_PARAMS_UPDATE_DELAY;
    cp_init.max_conn_params_update_count = aws_ble_gap_configMAX_CONN_PARAMS_UPDATE_COUNT;
    cp_init.start_on_notify_cccd_handle = BLE_GATT_HANDLE_INVALID;
    cp_init.disconnect_on_fail = false;
    cp_init.evt_handler = prvOnConnParamsEvt;
    cp_init.error_handler = prvConnParamsErrorHandler;

    xErrCode = ble_conn_params_init( &cp_init );
    BT_NRF_PRINT_ERROR( ble_conn_params_init, xErrCode );
    return xErrCode;
}

/*-----------------------------------------------------------*/

static void prvSetLatestConnParams( const BTBdaddr_t * pxBdAddr,
                                          uint32_t ulMinInterval,
                                          uint32_t ulMaxInterval,
                                          uint32_t ulLatency,
                                          uint32_t ulTimeout)
{
    xLatestDesiredConnectionParams.pxBdAddr = pxBdAddr;
    xLatestDesiredConnectionParams.ulLatency = ulLatency;
    xLatestDesiredConnectionParams.ulMaxInterval = ulMaxInterval;
    xLatestDesiredConnectionParams.ulMinInterval = ulMinInterval;
    xLatestDesiredConnectionParams.ulTimeout = ulTimeout;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTConnParameterUpdateRequest( const BTBdaddr_t * pxBdAddr,
                                            uint32_t ulMinInterval,
                                            uint32_t ulMaxInterval,
                                            uint32_t ulLatency,
                                            uint32_t ulTimeout )
{
    ble_gap_conn_params_t xConnParams;
    BTStatus_t xStatus;

    prvSetLatestConnParams( pxBdAddr, ulMinInterval, ulMaxInterval, ulLatency, ulTimeout);

    memset( &xConnParams, 0, sizeof( xConnParams ) );
    xConnParams.min_conn_interval = ulMinInterval;
    xConnParams.max_conn_interval = ulMaxInterval;
    xConnParams.slave_latency = ulLatency;
    xConnParams.conn_sup_timeout = ulTimeout;

    ret_code_t xErrCode = ble_conn_params_change_conn_params( usGattConnHandle, &xConnParams );
    xStatus = BTNRFError( xErrCode );

    return xStatus;
}

/*-----------------------------------------------------------*/

static void prvOnConnParamsEvt( ble_conn_params_evt_t * pxEvt )
{
    ret_code_t xErrCode;

    if( pxEvt->evt_type == BLE_CONN_PARAMS_EVT_FAILED )
    {
        xErrCode = sd_ble_gap_disconnect( usConnHandle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE );
        BT_NRF_PRINT_ERROR( sd_ble_gap_disconnect, xErrCode );
    }
}

/**@brief Function for handling a Connection Parameters error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void prvConnParamsErrorHandler( uint32_t ulError )
{
    APP_ERROR_HANDLER( ulError );
}


void prvOnAdvEvt( ble_adv_evt_t const adv_evt )
{
}

void prvOnAdvErr( uint32_t nrf_error )
{
}
